# First Task

In [78]:
import sqlite3
import pandas as pd
import seaborn as sns

In [11]:
## Set up database -- conn is a connection to the database c is a cursor object to interact with the connection
conn = sqlite3.connect("data/challenge_db.db")

c = conn.cursor()

In [13]:
# reset db
c.execute("""DROP TABLE locations""")
c.execute("""DROP TABLE payments""")

In [14]:
## create a locations table from the csv
# via c.execute(query) with query as multiline string
c.execute("""CREATE TABLE locations (uuid varchar,
locationGroupId varchar, paymentActive bool, companyName varchar, city varchar)""")

In [15]:
## same for payments from csv
c.execute("""CREATE TABLE payments (uuid varchar, locationId varchar, paymentCreatedAt datetime, 
totalAmount float, status varchar)""")

In [18]:
## Now load the csvs as dataframes
payments = pd.read_csv("data/payments.csv")
locations = pd.read_csv("data/locations.csv")
# get rid of unnamed first column
payments = payments.iloc[:, 1:]
locations = locations.iloc[:, 1:]

In [19]:
payments.to_sql("payments", con = conn, if_exists="replace", index=False)

383

In [20]:
locations.to_sql("locations", con = conn, if_exists="replace", index=False)

366

In [21]:
### use pd.read_sql() with query to get the joined tables
joined_df = pd.read_sql("""SELECT * FROM locations JOIN payments ON locations.uuid=payments.locationId""", conn)

In [22]:
joined_df.head()

,uuid,locationGroupId,paymentActive,companyName,city,uuid,locationId,paymentCreatedAt,totalAmount,status
0,c7c6549a-8226-5cc5-98ae-dd3e89d4586e,ee34290f-711f-582b-864f-14ed09e58c11,1,culture4life GmbH,Berlin,03cec838-d3ba-52f3-9eb1-3bf9da16cdf8,c7c6549a-8226-5cc5-98ae-dd3e89d4586e,2022-04-29 15:00:38.000000 +00:00,1.1,CLO
1,c7c6549a-8226-5cc5-98ae-dd3e89d4586e,ee34290f-711f-582b-864f-14ed09e58c11,1,culture4life GmbH,Berlin,08d50f76-635e-5034-9ccf-443e90d7ba6e,c7c6549a-8226-5cc5-98ae-dd3e89d4586e,2022-06-17 09:08:10.000000 +00:00,5.5,CLO
2,c7c6549a-8226-5cc5-98ae-dd3e89d4586e,ee34290f-711f-582b-864f-14ed09e58c11,1,culture4life GmbH,Berlin,0c2d33a6-d577-5ff0-ba2a-f33d23fdd8c1,c7c6549a-8226-5cc5-98ae-dd3e89d4586e,2022-05-31 10:45:41.000000 +00:00,3.3,CLO
3,c7c6549a-8226-5cc5-98ae-dd3e89d4586e,ee34290f-711f-582b-864f-14ed09e58c11,1,culture4life GmbH,Berlin,0e2c6524-cd62-51c3-976d-1909051ba888,c7c6549a-8226-5cc5-98ae-dd3e89d4586e,2022-05-19 15:21:28.000000 +00:00,2.0,CLO
4,c7c6549a-8226-5cc5-98ae-dd3e89d4586e,ee34290f-711f-582b-864f-14ed09e58c11,1,culture4life GmbH,Berlin,0fa854d7-6234-5af4-becf-295d3aa95de5,c7c6549a-8226-5cc5-98ae-dd3e89d4586e,2022-05-06 15:25:03.000000 +00:00,5.5,CLO

In [23]:
joined_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 383 entries, 0 to 382
Data columns (total 10 columns):
 #   Column            Non-Null Count  Dtype
---  ------            --------------  -----
 0   uuid              383 non-null    object
 1   locationGroupId   383 non-null    object
 2   paymentActive     383 non-null    int64
 3   companyName       383 non-null    object
 4   city              383 non-null    object
 5   uuid              383 non-null    object
 6   locationId        383 non-null    object
 7   paymentCreatedAt  383 non-null    object
 8   totalAmount       383 non-null    float64
 9   status            383 non-null    object
dtypes: float64(1), int64(1), object(8)
memory usage: 30.0+ KB

In [24]:
joined_df["paymentCreatedAt"] = pd.to_datetime(joined_df["paymentCreatedAt"])

In [25]:
joined_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 383 entries, 0 to 382
Data columns (total 10 columns):
 #   Column            Non-Null Count  Dtype
---  ------            --------------  -----
 0   uuid              383 non-null    object
 1   locationGroupId   383 non-null    object
 2   paymentActive     383 non-null    int64
 3   companyName       383 non-null    object
 4   city              383 non-null    object
 5   uuid              383 non-null    object
 6   locationId        383 non-null    object
 7   paymentCreatedAt  383 non-null    datetime64[ns, UTC]
 8   totalAmount       383 non-null    float64
 9   status            383 non-null    object
dtypes: datetime64[ns, UTC](1), float64(1), int64(1), object(7)
memory usage: 30.0+ KB

In [26]:
joined_df["paymentCreatedAt"].min()

Timestamp('1970-01-01 00:00:00+0000', tz='UTC')

In [27]:
joined_df["paymentCreatedAt"].max()

Timestamp('2022-07-05 13:14:12+0000', tz='UTC')

In [28]:
joined_df.sort_values(by = "paymentCreatedAt")

,uuid,locationGroupId,paymentActive,companyName,city,uuid,locationId,paymentCreatedAt,totalAmount,status
89,20cc0d83-486f-5000-91eb-b695196458c5,3bd04d8b-bc3f-59e8-899b-c901a5349103,1,culture4life GmbH,Berlin,4f410a1d-f1ec-5f0e-adb2-f3c101c69712,20cc0d83-486f-5000-91eb-b695196458c5,1970-01-01 00:00:00+00:00,5.50,ERR
329,e90abf83-0b13-5731-816d-124706f6b1b1,8d82d38f-495f-5acf-83a5-40a75d2450a0,1,Café Bar Cultura,Kiel,f115c3ee-d1c0-5d8e-83d4-9378034757cf,e90abf83-0b13-5731-816d-124706f6b1b1,1970-01-01 00:00:00+00:00,19.00,ERR
105,20cc0d83-486f-5000-91eb-b695196458c5,3bd04d8b-bc3f-59e8-899b-c901a5349103,1,culture4life GmbH,Berlin,817b7af9-1891-51ee-92eb-6019b3dbfc04,20cc0d83-486f-5000-91eb-b695196458c5,1970-01-01 00:00:00+00:00,0.55,ERR
110,20cc0d83-486f-5000-91eb-b695196458c5,3bd04d8b-bc3f-59e8-899b-c901a5349103,1,culture4life GmbH,Berlin,96c6a089-7671-5fa4-a01f-98d3ae055894,20cc0d83-486f-5000-91eb-b695196458c5,1970-01-01 00:00:00+00:00,0.55,ERR
120,20cc0d83-486f-5000-91eb-b695196458c5,3bd04d8b-bc3f-59e8-899b-c901a5349103,1,culture4life GmbH,Berlin,bcee2f64-b445-55b3-b3e1-f5522030cf7c,20cc0d83-486f-5000-91eb-b695196458c5,1970-01-01 00:00:00+00:00,5.50,ERR
...,...,...,...,...,...,...,...,...,...,...
97,20cc0d83-486f-5000-91eb-b695196458c5,3bd04d8b-bc3f-59e8-899b-c901a5349103,1,culture4life GmbH,Berlin,5ad0b190-a7a8-556c-99c2-ba4897b85942,20cc0d83-486f-5000-91eb-b695196458c5,2022-07-04 20:20:02+00:00,0.50,CLO
345,054e08f5-cf0e-52ef-ac37-c09e74e4842e,b1a4540f-bb26-5d7f-99dd-0d5204b759d9,1,Nah am Wasser,Berlin,daade908-54ae-51be-b444-6da23cc34a70,054e08f5-cf0e-52ef-ac37-c09e74e4842e,2022-07-05 06:21:18+00:00,1.10,CLO
382,b00c8469-05fc-5a2d-874e-16b116ed8c4f,6b094bf1-6708-5b47-b183-7e31e9e74058,1,Schlosspark-Grill,Berlin,bde0284f-018a-5e5c-ab21-f08bc3ed5462,b00c8469-05fc-5a2d-874e-16b116ed8c4f,2022-07-05 09:15:48+00:00,1.10,CLO
141,20cc0d83-486f-5000-91eb-b695196458c5,3bd04d8b-bc3f-59e8-899b-c901a5349103,1,culture4life GmbH,Berlin,eb824390-6807-5e45-b39c-ed163fb56bb9,20cc0d83-486f-5000-91eb-b695196458c5,2022-07-05 10:38:15+00:00,1.10,CLO
136,20cc0d83-486f-5000-91eb-b695196458c5,3bd04d8b-bc3f-59e8-899b-c901a5349103,1,culture4life GmbH,Berlin,df166de9-dc3f-5315-898f-7714ea151654,20cc0d83-486f-5000-91eb-b695196458c5,2022-07-05 13:14:12+00:00,1.10,CLO

In [29]:
joined_df = joined_df.loc[joined_df.status != "ERR", ]

In [30]:
joined_df.paymentCreatedAt.min()

Timestamp('2022-04-29 13:41:08+0000', tz='UTC')

In [37]:
joined_df.loc[:, "week"] = joined_df.paymentCreatedAt.dt.isocalendar().week
joined_df.loc[:, "month"] = joined_df.paymentCreatedAt.dt.month

/tmp/ipykernel_20089/3757674282.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  joined_df.loc[:, "week"] = joined_df.paymentCreatedAt.dt.isocalendar().week
/tmp/ipykernel_20089/3757674282.py:2: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  joined_df.loc[:, "month"] = joined_df.paymentCreatedAt.dt.month

In [38]:
joined_df.head()

,uuid,locationGroupId,paymentActive,companyName,city,uuid,locationId,paymentCreatedAt,totalAmount,status,week,month
0,c7c6549a-8226-5cc5-98ae-dd3e89d4586e,ee34290f-711f-582b-864f-14ed09e58c11,1,culture4life GmbH,Berlin,03cec838-d3ba-52f3-9eb1-3bf9da16cdf8,c7c6549a-8226-5cc5-98ae-dd3e89d4586e,2022-04-29 15:00:38+00:00,1.1,CLO,17,4
1,c7c6549a-8226-5cc5-98ae-dd3e89d4586e,ee34290f-711f-582b-864f-14ed09e58c11,1,culture4life GmbH,Berlin,08d50f76-635e-5034-9ccf-443e90d7ba6e,c7c6549a-8226-5cc5-98ae-dd3e89d4586e,2022-06-17 09:08:10+00:00,5.5,CLO,24,6
2,c7c6549a-8226-5cc5-98ae-dd3e89d4586e,ee34290f-711f-582b-864f-14ed09e58c11,1,culture4life GmbH,Berlin,0c2d33a6-d577-5ff0-ba2a-f33d23fdd8c1,c7c6549a-8226-5cc5-98ae-dd3e89d4586e,2022-05-31 10:45:41+00:00,3.3,CLO,22,5
3,c7c6549a-8226-5cc5-98ae-dd3e89d4586e,ee34290f-711f-582b-864f-14ed09e58c11,1,culture4life GmbH,Berlin,0e2c6524-cd62-51c3-976d-1909051ba888,c7c6549a-8226-5cc5-98ae-dd3e89d4586e,2022-05-19 15:21:28+00:00,2.0,CLO,20,5
4,c7c6549a-8226-5cc5-98ae-dd3e89d4586e,ee34290f-711f-582b-864f-14ed09e58c11,1,culture4life GmbH,Berlin,0fa854d7-6234-5af4-becf-295d3aa95de5,c7c6549a-8226-5cc5-98ae-dd3e89d4586e,2022-05-06 15:25:03+00:00,5.5,CLO,18,5

In [45]:
sales_by_week = pd.read_sql("""SELECT totalAmount, strftime("%W", paymentCreatedAt) as weeknum 
FROM payments""", conn)

In [46]:
sales_by_week

     totalAmount weeknum
0           1.10      27
1          28.08      22
2         131.76      23
3          76.80      23
4           0.00      23
..           ...     ...
378         3.30      26
379         3.85      26
380         1.10      27
381         1.10      27
382        82.50      26

[383 rows x 2 columns]

In [64]:
query_sum_by_week = """
SELECT SUM(totalAmount) AS total, strftime("%W", payments.paymentCreatedAt) AS weeknum 
FROM payments
WHERE NOT payments.status = "ERR"
GROUP BY weeknum
"""

In [65]:
sum_sales_by_week = pd.read_sql(query_sum_by_week, conn)

In [66]:
sum_sales_by_week

      total weeknum
0     32.17      17
1    324.38      18
2     29.71      19
3    223.85      20
4     28.61      21
5    111.12      22
6    531.69      23
7    860.56      24
8    723.20      25
9   1893.49      26
10   106.83      27

In [63]:
from ipywidgets import interact, interactive, fixed, interact_manual
import ipywidgets as widgets

In [74]:
@interact
def get_df(val = ["total", "average"], time = ["week", "month"]):
    if val == "total":
        func = "SUM"
    elif val == "average":
        func = "AVG"
    if time == "week":
        dt_format = "%W"
        col_name = "week"
    elif time == "month":
        dt_format = "%m"
        col_name = "month"
    
    df = pd.read_sql(f"""SELECT {func}(totalAmount) AS total, \
    strftime('{dt_format}', payments.paymentCreatedAt) AS {col_name} \
FROM payments \
WHERE NOT payments.status = 'ERR'\
GROUP BY {col_name}""", con = conn)
    df.head()
    return df

interactive(children=(Dropdown(description='val', options=('total', 'average'), value='total'), Dropdown(descr…

UnboundLocalError: local variable 'func' referenced before assignment

In [84]:
def task_one(val, time):
    if val == "total":
        func = "SUM"
    elif val == "average":
        func = "AVG"
    if time == "week":
        dt_format = "%W"
        col_name = "week"
    elif time == "month":
        dt_format = "%m"
        col_name = "month"
    
    df = pd.read_sql(f"""SELECT {func}(totalAmount) AS '{val}', \
    strftime('{dt_format}', payments.paymentCreatedAt) AS {col_name} \
FROM payments \
WHERE NOT payments.status = 'ERR'\
GROUP BY {col_name}""", con = conn)
    sns.barplot(y = df[val], x = df[time])
    return None

In [85]:
interact(task_one, val=["total", "average"], time = ["week", "month"])

interactive(children=(Dropdown(description='val', options=('total', 'average'), value='total'), Dropdown(descr…